Revit 2027 API
LoadType Enumeration
 This enum declares types of Loads.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadType
Public Enumeration LoadType
public enum class LoadType
type LoadType
Members
Member name | Value | Description
Area | 2 |  Area Load
Line | 1 |  Line Load
Point | 0 |  Point Load
See Also
Reference
Autodesk.Revit.DB.Structure Namespace